import telebot
import os

# Берем токен из настроек сервера (для безопасности на GitHub/Render)
TOKEN = os.environ.get('BOT_TOKEN')
bot = telebot.TeleBot(TOKEN)

@bot.message_handler(commands=['start'])
def start_message(message):
    text = """Нужны деньги? Просто записывай видео-отзывы! 
Покупаем твои кружочки и интервью. Дорого. Постоянно. Стабильно.

Для старта сотрудничества нужно выполнить тестовое задание:

Запиши кружок на 5 сек: «Привет, хочу делать отзывы и получать деньги».

👉 Скидывай сюда: @movsienkoivhr"""
    bot.send_message(message.chat.id, text)

if __name__ == '__main__':
    print("Бот запущен...")
    bot.infinity_polling()